## Assignment
<b>Take this monstrosity as the DataFrame to use in the following puzzles:</b><br>
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],

'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],

'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],

'Airline': ['KLM(!)', '

In [2]:
import pandas as pd
import numpy as np

In [27]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [28]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

<b>Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).</b>

In [29]:
'''df['FlightNumber'].fillna(value=df['FlightNumber'][0]+10, limit=1, inplace=True)
df['FlightNumber'].fillna(value=df['FlightNumber'][2]+10, limit=1, inplace=True)'''

"df['FlightNumber'].fillna(value=df['FlightNumber'][0]+10, limit=1, inplace=True)\ndf['FlightNumber'].fillna(value=df['FlightNumber'][2]+10, limit=1, inplace=True)"

In [30]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [31]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

<b>2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.</b>

In [45]:
df[['From', 'To']] = df['From_To'].str.split('_', 1, expand=True)

<b>4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.</b>

In [47]:
df.drop('From_To',axis=1,inplace=True)

<b>3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)</b>

In [53]:
def fun(name):
    return name.str.capitalize()

In [54]:
df[['From', 'To']]=df[['From', 'To']].apply(fun)

In [55]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

<b>5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.</b>

In [61]:
delays=pd.DataFrame(df["RecentDelays"].to_list(), columns=['delay_1', 'delay_2','delay_3'])

In [62]:
df.insert(loc = 3, column='delay_1' , value=delays['delay_1'])
df.insert(loc = 4, column='delay_2' , value=delays['delay_2'])
df.insert(loc = 5, column='delay_3' , value=delays['delay_3'])
df

,FlightNumber,RecentDelays,Airline,delay_1,delay_2,delay_3,From,To
0,10045,"[23, 47]",KLM(!),23.0,47.0,NaN,London,Paris
1,10055,[],<Air France> (12),NaN,NaN,NaN,Madrid,Milan
2,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0,London,Stockholm
3,10075,[13],12. Air France,13.0,NaN,NaN,Budapest,Paris
4,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN,Brussels,London

In [63]:
df.drop(['RecentDelays'], inplace=True, axis=1)
df

,FlightNumber,Airline,delay_1,delay_2,delay_3,From,To
0,10045,KLM(!),23.0,47.0,NaN,London,Paris
1,10055,<Air France> (12),NaN,NaN,NaN,Madrid,Milan
2,10065,(British Airways. ),24.0,43.0,87.0,London,Stockholm
3,10075,12. Air France,13.0,NaN,NaN,Budapest,Paris
4,10085,"""Swiss Air""",67.0,32.0,NaN,Brussels,London